<a href="https://colab.research.google.com/github/shreejitp/Python/blob/master/Pandas_Part2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Summarizing and Computing Descriptive Statistics

In [0]:
import pandas as pd 
import numpy as np

In [0]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [0]:
# Sum returns a series with sum of columns 
df.sum()

one    9.25
two   -5.80
dtype: float64

In [0]:
#Getting Sum across columns by using axis=1
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [0]:
#using the skipna parameter 
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [0]:
#Some methods, like idxmin and idxmax, return indirect statistics like the index value where the minimum or maximum values are attained
df.idxmax()

one    b
two    d
dtype: object

Describe is one such example, producing multiple summary statistics in one shot

In [0]:
#df.describe()
# If you want to describe some specific columns 
df[['one','two']].describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

#Correlation and Covariance

In [0]:
!pip install pandas-datareader

Requirement already satisfied: pandas-datareader in /usr/local/lib/python3.6/dist-packages (0.7.4)
Requirement already satisfied: requests>=2.3.0 in /usr/local/lib/python3.6/dist-packages (from pandas-datareader) (2.21.0)
Requirement already satisfied: wrapt in /usr/local/lib/python3.6/dist-packages (from pandas-datareader) (1.11.2)
Requirement already satisfied: pandas>=0.19.2 in /usr/local/lib/python3.6/dist-packages (from pandas-datareader) (0.25.3)
Requirement already satisfied: lxml in /usr/local/lib/python3.6/dist-packages (from pandas-datareader) (4.2.6)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas-datareader) (2019.9.11)
Requirement already satisfied: urllib3<1.25,>=1.21.1 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas-datareader) (1.24.3)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas-datareader) (3.0.4)
Requirement already satisfied: idna<2.9,>=2.5 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas-datareader) (2.8)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.19.2->pandas-datareader) (2.6.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.19.2->pandas-datareader) (2018.9)
Requirement already satisfied: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.19.2->pandas-datareader) (1.17.4)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas>=0.19.2->pandas-datareader) (1.12.0)

In [0]:
#Using the pandas_datareader module to download some data for a few stock tickers
import pandas_datareader.data as web

In [0]:
all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [0]:
all_data

In [0]:
price = pd.DataFrame({ticker: data['Adj Close']
for ticker, data in all_data.items()})

In [0]:
#price

                  AAPL         IBM        MSFT         GOOG
Date
2010-01-04   26.601469   96.997330   24.360727   312.204773
2010-01-05   26.647457   95.825584   24.368599   310.829926
2010-01-06   26.223597   95.203102   24.219046   302.994293
2010-01-07   26.175119   94.873573   23.967175   295.940735
2010-01-08   26.349140   95.825584   24.132469   299.885956
...                ...         ...         ...          ...
2019-11-22  261.779999  134.339996  149.589996  1295.339966
2019-11-25  266.369995  135.970001  151.229996  1306.689941
2019-11-26  264.290009  135.089996  152.029999  1313.550049
2019-11-27  267.839996  133.770004  152.320007  1312.989990
2019-11-29  267.250000  134.449997  151.380005  1304.959961

[2495 rows x 4 columns]

In [0]:
volume = pd.DataFrame({ticker: data['Volume']
for ticker, data in all_data.items()})

In [0]:
volume

                   AAPL        IBM        MSFT        GOOG
Date
2010-01-04  123432400.0  6155300.0  38409100.0   3927000.0
2010-01-05  150476200.0  6841400.0  49749600.0   6031900.0
2010-01-06  138040000.0  5605300.0  58182400.0   7987100.0
2010-01-07  119282800.0  5840600.0  50559700.0  12876600.0
2010-01-08  111902700.0  4197200.0  51197400.0   9483900.0
...                 ...        ...         ...         ...
2019-11-22   16331300.0  3297500.0  15901800.0   1385700.0
2019-11-25   21005100.0  2590100.0  22420900.0   1036200.0
2019-11-26   26301900.0  3793200.0  24620100.0   1069700.0
2019-11-27   16308900.0  3280900.0  15184400.0    995600.0
2019-11-29   11654400.0  1825300.0  11977300.0    587000.0

[2495 rows x 4 columns]

In [0]:
#Computing percent changes of the prices

In [0]:
returns = price.pct_change()

In [0]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-11-22 -0.000878  0.003736  0.000736 -0.004618
2019-11-25  0.017534  0.012133  0.010963  0.008762
2019-11-26 -0.007809 -0.006472  0.005290  0.005250
2019-11-27  0.013432 -0.009771  0.001908 -0.000426
2019-11-29 -0.002203  0.005083 -0.006171 -0.006116

The corr method of Series computes the correlation of the overlapping, non-NA, aligned-by-index values in two Series. Relatedly, cov computes the covariance

In [0]:
#Correlation  
returns['MSFT'].corr(returns['IBM'])

0.4902092706627884

In [0]:
#Covariance 
returns['MSFT'].cov(returns['IBM'])

DataFrame’s corr and cov methods, on the other hand, return a full correlation or covariance matrix as a DataFrame,

In [0]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.385114  0.457220  0.464369
IBM   0.385114  1.000000  0.490209  0.406547
MSFT  0.457220  0.490209  1.000000  0.540851
GOOG  0.464369  0.406547  0.540851  1.000000

In [0]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000264  0.000077  0.000107  0.000117
IBM   0.000077  0.000153  0.000087  0.000078
MSFT  0.000107  0.000087  0.000206  0.000120
GOOG  0.000117  0.000078  0.000120  0.000239

**Passing a DataFrame computes the correlations of matching column names. Here I compute correlations of percent changes with volume**

In [0]:
#Correlation of Price and Volume using corrwith
returns.corrwith(volume)

AAPL   -0.065633
IBM    -0.158186
MSFT   -0.090274
GOOG   -0.019507
dtype: float64

#Unique Values, Value Counts, and Membership

In [0]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [0]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [0]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [0]:
pd.value_counts(obj.values, sort=False)

d    1
c    3
b    2
a    3
dtype: int64

Index.get_indexer method, which gives you an index array from an array of possibly non-distinct values into another array of distinct values

In [0]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [0]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [0]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In some cases, you may want to compute a histogram on multiple related columns in a DataFrame. Here’s an example

In [0]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
       .....:                      'Qu2': [2, 3, 1, 2, 3],
       .....:                      'Qu3': [1, 5, 2, 4, 4]})

In [0]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [0]:
#Here, the row labels in the result are the distinct values occurring in all of the col‐ umns. 
#The values are the respective counts of these values in each column
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0